var users = ['Обрати','Аверін  Кирил','Андронік Аліна','Антонюк  Володимир ','Бас Дмитро','Власов Арсеній','Войтович Марина','Гаврилюк  Назарій ','Гаврилюк  Назарій ','Герасимчук Владислав','Данілін Кирило ','Діжа Олексій','Духніч  Анастасія ','Зубрицький Арсеній','Карнажицький  Іван','Катунов Данііл','Кащук Тимур','Корячков  Віктор','Крачковський Артем','Лаетін Дмитро','Милостивий Артем','Ніколенко Богдан','Омельчук  Олександр ','Парфенюк  Вікторія','Сархан Назар','Сархан Назар','Сархан  Назар','Сова  Олександр ','Стенюк  Марина','Танський  Лев ','Хоменко Дмитро','Петренко Валерія'
];

var select = document.getElementById("name-input");

// Цикл для проходження по масиву користувачів та додавання їх до селектора
for (var i = 0; i < users.length; i++) {
  var option = document.createElement("option"); // Створюємо новий елемент <option>
  option.text = users[i]; // Встановлюємо текст опції як ім'я користувача
  select.add(option); // Додаємо опцію до селектора
}
