var users = ['Оберіть користувача','Місіонжнік Нікіта','Павлюк Дарина','Романчук Максим','Рослякова Ніна','Слівко Микола','Соколов Владислав','Ущапівський Іван','Ущапівський Іван','Фотін Андрій','Хоменко Владислав','Хомик Анна','Шахрай Артем','Соколов  Владислав ','Новак Данило','Павелеску Іван','Ляховець Анастасія'
];

var select = document.getElementById("name-input");

// Цикл для проходження по масиву користувачів та додавання їх до селектора
for (var i = 0; i < users.length; i++) {
  var option = document.createElement("option"); // Створюємо новий елемент <option>
  option.text = users[i]; // Встановлюємо текст опції як ім'я користувача
  select.add(option); // Додаємо опцію до селектора
}
